Docs/Reference/Content/images/dependencies/net8.0/d2/alloverit-aws-cdk-appsync.d2
direction: left

aoi: AllOverIt
aoi.alloverit-aws-cdk-appsync: AllOverIt.Aws.Cdk.AppSync
amazon-cdk-lib_2-261-0: Amazon.CDK.Lib\nv2.261.0
amazon-cdk-asset-awscliv1_2-2-282: Amazon.CDK.Asset.AwsCliV1\nv2.2.282
amazon-cdk-asset-nodeproxyagentv6_2-1-2: Amazon.CDK.Asset.NodeProxyAgentV6\nv2.1.2
amazon-cdk-cloudassembly-schema_54-0-0: Amazon.CDK.CloudAssembly.Schema\nv54.0.0
amazon-jsii-runtime_1-138-0: Amazon.JSII.Runtime\nv1.138.0
constructs_10-5-0: Constructs\nv10.5.0
microsoft-extensions-dependencyinjection_9-0-1: Microsoft.Extensions.DependencyInjection\nv9.0.1
microsoft-extensions-logging_9-0-1: Microsoft.Extensions.Logging\nv9.0.1
microsoft-extensions-logging-console_9-0-1: Microsoft.Extensions.Logging.Console\nv9.0.1
newtonsoft-json_13-0-3: Newtonsoft.Json\nv13.0.3
cdklabs-awscdkappsyncutils_0-0-858: Cdklabs.AwsCdkAppsyncUtils\nv0.0.858
aoi.alloverit: AllOverIt
aoi.alloverit-assertion: AllOverIt.Assertion
amazon-cdk-lib_2-261-0 <- aoi.alloverit-aws-cdk-appsync
amazon-cdk-asset-awscliv1_2-2-282 <- amazon-cdk-lib_2-261-0
amazon-cdk-asset-nodeproxyagentv6_2-1-2 <- amazon-cdk-lib_2-261-0
amazon-cdk-cloudassembly-schema_54-0-0 <- amazon-cdk-lib_2-261-0
amazon-jsii-runtime_1-138-0 <- amazon-cdk-lib_2-261-0
constructs_10-5-0 <- amazon-cdk-lib_2-261-0
amazon-jsii-runtime_1-138-0 <- aoi.alloverit-aws-cdk-appsync
microsoft-extensions-dependencyinjection_9-0-1 <- amazon-jsii-runtime_1-138-0
microsoft-extensions-logging_9-0-1 <- amazon-jsii-runtime_1-138-0
microsoft-extensions-logging-console_9-0-1 <- amazon-jsii-runtime_1-138-0
newtonsoft-json_13-0-3 <- amazon-jsii-runtime_1-138-0
cdklabs-awscdkappsyncutils_0-0-858 <- aoi.alloverit-aws-cdk-appsync
amazon-cdk-lib_2-261-0 <- cdklabs-awscdkappsyncutils_0-0-858
amazon-jsii-runtime_1-138-0 <- cdklabs-awscdkappsyncutils_0-0-858
constructs_10-5-0 <- cdklabs-awscdkappsyncutils_0-0-858
aoi.alloverit <- aoi.alloverit-aws-cdk-appsync
aoi.alloverit-assertion <- aoi.alloverit
amazon-cdk-lib_2-261-0.style.fill: "#ADD8E6"
amazon-cdk-lib_2-261-0.style.opacity: 0.8
amazon-cdk-asset-awscliv1_2-2-282.style.fill: "#FFEC96"
amazon-cdk-asset-awscliv1_2-2-282.style.opacity: 0.8
amazon-cdk-asset-nodeproxyagentv6_2-1-2.style.fill: "#FFEC96"
amazon-cdk-asset-nodeproxyagentv6_2-1-2.style.opacity: 0.8
amazon-cdk-cloudassembly-schema_54-0-0.style.fill: "#FFEC96"
amazon-cdk-cloudassembly-schema_54-0-0.style.opacity: 0.8
amazon-jsii-runtime_1-138-0.style.fill: "#ADD8E6"
amazon-jsii-runtime_1-138-0.style.opacity: 0.8
constructs_10-5-0.style.fill: "#FFEC96"
constructs_10-5-0.style.opacity: 0.8
microsoft-extensions-dependencyinjection_9-0-1.style.fill: "#FFEC96"
microsoft-extensions-dependencyinjection_9-0-1.style.opacity: 0.8
microsoft-extensions-logging_9-0-1.style.fill: "#FFEC96"
microsoft-extensions-logging_9-0-1.style.opacity: 0.8
microsoft-extensions-logging-console_9-0-1.style.fill: "#FFEC96"
microsoft-extensions-logging-console_9-0-1.style.opacity: 0.8
newtonsoft-json_13-0-3.style.fill: "#FFEC96"
newtonsoft-json_13-0-3.style.opacity: 0.8
cdklabs-awscdkappsyncutils_0-0-858.style.fill: "#ADD8E6"
cdklabs-awscdkappsyncutils_0-0-858.style.opacity: 0.8
aoi.style.fill: "#E7EBFC"
aoi.style.opacity: 1
